IDENTIFICATION DIVISION.
PROGRAM-ID. TESTMATH.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-A PIC 9(4) VALUE 10.
01 NUM-B PIC 9(4) VALUE 5.
01 RESULT PIC 9(4) VALUE 0.

PROCEDURE DIVISION.
    ADD NUM-A TO NUM-B.
    SUBTRACT NUM-A FROM NUM-B.
    MULTIPLY NUM-A BY NUM-B.
    DIVIDE NUM-A BY NUM-B GIVING RESULT.
    COMPUTE RESULT = NUM-A + NUM-B.
    COMPUTE RESULT = NUM-A - NUM-B.
    COMPUTE RESULT = NUM-A * NUM-B.
    COMPUTE RESULT = NUM-A / NUM-B.
    STOP RUN.
