IDENTIFICATION DIVISION.
PROGRAM-ID. COUNTER.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 NUM-COUNTER PIC 9(8) VALUE 0.

PROCEDURE DIVISION.
    ADD 1 TO NUM-COUNTER.
    DISPLAY NUM-COUNTER.
    STOP RUN.
